Revit 2027 API
FormatOptions.GetSymbolTypeId Method
 Gets the identifier of the symbol indicating the unit quantifying the value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ForgeTypeId GetSymbolTypeId()
Public Function GetSymbolTypeId As ForgeTypeId
public:
ForgeTypeId^ GetSymbolTypeId()
member GetSymbolTypeId : unit -> ForgeTypeId
Return Value
ForgeTypeId
 The symbol identifier. An empty identifier string indicates no symbol.
Exceptions
Exception | Condition
InvalidOperationException |  UseDefault is true in this FormatOptions.
See Also
Reference
FormatOptions Class
Autodesk.Revit.DB Namespace